[
  {
    "id": 1,
    "title": "Monster Chef",
    "assigned_to": "One player",
    "usage_label": "Once per floor",
    "lore": "Your mastery of dungeon cookery turns viscera into sustenance.",
    "body": "Cook 1–3 harvested monster parts to grant one 1-floor buff: +1d4 attack; +1d6 AC (max 18); heal 1d8 + party size; or chosen damage resistance. Choose a check: Cooking (Con) normal; Culinary Intuition (Int/Wis) grants advantage or an enhanced effect; Risky Delicacy (Cha DC 16) adds +1d6 temp HP on success, or causes nausea (disadvantage on one roll) on failure. On a natural 1 the dish spoils: each party member makes a DC 12 Con save or is poisoned for one floor.",
    "fonts": {}
  },
  {
    "id": 2,
    "title": "Forbidden Revival",
    "assigned_to": "The spellcaster or cleric",
    "usage_label": "Once per two floors",
    "lore": "Dark magic bends death itself to your will, but power always demands payment.",
    "body": "Once per two floors, you may perform a ritual to revive a dead party member or significant NPC. The creature returns to life fully restored, but exhausted. This exhaustion fades after a long rest or upon entry to the next floor.",
    "fonts": {}
  },
  {
    "id": 3,
    "title": "People Skills",
    "assigned_to": "The most charismatic character",
    "usage_label": "Once per day",
    "lore": "You understand humans in ways others don't—their motivations, fears, and weaknesses.",
    "body": "Once per day, when you make a social check such as Persuasion, Deception, or Intimidation against a humanoid enemy or NPC, you have advantage on the roll. This applies to dialogue with rival adventurers, human mercenaries, or other humanoids during confrontations. You may also attempt creative, improvised solutions against humanoid enemies during combat; such checks are made at advantage.",
    "fonts": {}
  },
  {
    "id": 4,
    "title": "Passage Finding",
    "assigned_to": "The rogue or most dexterous character",
    "usage_label": "Once per floor",
    "lore": "Your keen senses reveal hidden paths and deadly mechanisms.",
    "body": "Once per floor, you may spend ten minutes thoroughly searching an area for hidden passages, trapped doors, or environmental hazards. Make an Investigation check (DC 12). On a success, you discover a useful hidden feature such as a shortcut, a trap you can disarm, a safe passage, or additional resources like food, treasure, or monster parts. On a failed check, you trigger a minor trap that deals 1d6 damage, but you still learn its location for later.",
    "fonts": {}
  },
  {
    "id": 5,
    "title": "Iaijutsu",
    "assigned_to": "Fighter (long sword user)",
    "usage_label": "Once per long rest",
    "lore": "Your training in the Eastern Archipelago has focused your mind, and now your mind focuses your blade.",
    "body": "Before attacking a designated non-boss, make a Dex check vs DC 12 + target proficiency (min 12). On success, the target drops to 0 HP (dies outright). On failure, you still hit and deal double damage.",
    "fonts": {}
  },
  {
    "id": 6,
    "title": "Cursed Instinct",
    "assigned_to": "The beast-cursed human or kobold",
    "usage_label": "Once per floor",
    "lore": "Your curse grants you beastly abilities incompatible with your human self. Your soul is melded with that of a beast, and both halves of you now share one life.",
    "body": "Once per floor, when combat is about to begin, you may automatically win initiative for that encounter. You act first, before any other creature rolls. After you use this skill, you must roll initiative normally for all subsequent encounters on that floor and beyond.",
    "fonts": {}
  },
  {
    "id": 7,
    "title": "Monsterologist",
    "assigned_to": "The most monster-obsessed character",
    "usage_label": "Once per floor",
    "lore": "Your love of monsters is so great that you once considered studying to become a monster researcher.",
    "body": "Once per floor, you may ask the DM three questions about any monster—its weaknesses, hit points, upcoming encounters, or other relevant details. The answers are mostly perfectly detailed, reflecting your encyclopedic knowledge of the dungeon and its denizens.",
    "fonts": {}
  }
]
